"""
Задача 3 на 10 балов

Задачки для закрепления

1) Программа Выводит экран

Каждый 5й элемент последовательности.

'(etnfづzxfk｡12dt◕`1ad‿6hns‿1zQY◕Cd$y｡FtSq)Ze6?づ#2)$'

Уточнение:

Первым элементом итоговой последовательности должен быть первый элемент начальной последовательности.

Строка в кавычках, кавычки в данном случае не считаются элементом строки

"""
#assign text
txt_from_teacher = str('(etnfづzxfk｡12dt◕`1ad‿6hns‿1zQY◕Cd$y｡FtSq)Ze6?づ#2)$')
#Show text and set output parameters
print(txt_from_teacher[0::5])

